### 빅데이터 분석 복습

In [92]:
# 필요 라이브러리 사용등록

import pandas as pd

In [93]:
urlPath = r'https://raw.githubusercontent.com/hugoMGSung/works-need-it-data-analysis/main/bigdata-python-2023/Day06/data/%EC%B6%A9%EC%B2%AD%EB%B6%81%EB%8F%84_%ED%91%B8%EB%93%9C%EB%B1%85%ED%81%AC%ED%98%84%ED%99%A9.csv'
dfCbFoodBank = pd.read_csv(urlPath)
dfCbFoodBank.tail() # head() 보다는 tail()로 전체 갯수를 확인

,지역,시군구,센터단위,센터구분,지원센터,신고구분,운영단체명,운영법인분류(대),대표자명,센터전화번호,주소,등록일자
24,충북,충청북도 음성군,기초,푸드뱅크,한울사랑나눔,당연신고,한울사랑나눔푸드뱅크,개인 운영,이*경,043-878-4312,음성군 생극면 음성로 1620번길 7,2011-11-25
25,충북,충청북도 음성군,기초,푸드뱅크,관성푸드뱅크,당연신고,개인,개인 운영,유*호,043-877-9457,음성군 삼성면 대성로547번길 12,2014-04-18
26,충북,충청북도 단양군,기초,푸드뱅크,단양군푸드뱅크,임의신고,단양군사회복지협의회,법인 운영,김*학,043-422-1299,"단양군 단양읍 수변로 83, 3층",2022-12-01
27,충북,충청북도 단양군,기초,푸드뱅크,단양나눔과기쁨,당연신고,기독교대한성결교회(단양수정교회),법인 운영,함*용,043-421-3191,단양군 대강면 장림1길 6,2012-04-17
28,충북,충청북도 단양군,기초,푸드마켓,단양군푸드마켓,임의신고,단양군사회복지협의회,법인 운영,김*학,043-422-1700,"단양군 단양읍 중앙1로 29, 1층",2012-06-22

In [94]:
dfCbFoodBank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 12 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   지역         29 non-null     object
 1   시군구        29 non-null     object
 2   센터단위       29 non-null     object
 3   센터구분       29 non-null     object
 4   지원센터       29 non-null     object
 5   신고구분       29 non-null     object
 6   운영단체명      29 non-null     object
 7   운영법인분류(대)  29 non-null     object
 8   대표자명       29 non-null     object
 9   센터전화번호     29 non-null     object
 10  주소         29 non-null     object
 11  등록일자       29 non-null     object
dtypes: object(12)
memory usage: 2.8+ KB

In [95]:
# 판다스 샘플데이터 생성
df = pd.DataFrame({'float' : [1.0], 'int' : [1], 'datetime' : [pd.Timestamp('20240315')], 
                   'string' : ['dummy'], 'boolean' : [False]})

df

   float  int   datetime string  boolean
0    1.0    1 2024-03-15  dummy    False

# 판다스 데이터타입과 파이썬 데이터타입은 다름
## 기본적인 타입
1. float -> float64
2. int -> int64
3. pd.Timestamp() -> datetime64, string
4. 'yyyy-mm-dd' ->

In [96]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   float     1 non-null      float64
 1   int       1 non-null      int64
 2   datetime  1 non-null      datetime64[ns]
 3   string    1 non-null      object
 4   boolean   1 non-null      bool
dtypes: bool(1), datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 165.0+ bytes

In [97]:
df.dtypes

float              float64
int                  int64
datetime    datetime64[ns]
string              object
boolean               bool
dtype: object

In [98]:
df = df.astype({'float' : 'float32'})
df.dtypes

float              float32
int                  int64
datetime    datetime64[ns]
string              object
boolean               bool
dtype: object

In [99]:
df = df.astype({'int' : 'int32'}) # int2, int 16, int8, int == int32
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   float     1 non-null      float32
 1   int       1 non-null      int32
 2   datetime  1 non-null      datetime64[ns]
 3   string    1 non-null      object
 4   boolean   1 non-null      bool
dtypes: bool(1), datetime64[ns](1), float32(1), int32(1), object(1)
memory usage: 157.0+ bytes

#### 판다스 데이터타입
```shell
| >> (구분자) 사용하여 마크다운에서 표 만들기
```
|dtype| 설명 | 비고 |
|-----| --- | --- |
|**float64**|실수타입|기본값|
|float32, 16, 8|실수타입(작은 크기)|옵션(float64에서 변경 가능)|
|**int64**|정수타입|기본값|
|int32, 16, 8|정수타입(작은 크기)|옵션|
|datetime64|날짜| |
|**object**|문자열 or 복합형| |
|bool|불형| |
|category|카테고리| |

In [100]:
## 판다스 카테고리
df = pd.DataFrame({'id' : [1,2,3,4,5,6], 'raw_grade' : ['a','b', 'c', 'd+', 'd', 'f']})

df

   id raw_grade
0   1         a
1   2         b
2   3         c
3   4        d+
4   5         d
5   6         f

In [101]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   raw_grade  6 non-null      object
dtypes: int64(1), object(1)
memory usage: 228.0+ bytes

In [102]:
## 카테고리 변환
df['grade'] = df['raw_grade'].astype('category')

df

   id raw_grade grade
0   1         a     a
1   2         b     b
2   3         c     c
3   4        d+    d+
4   5         d     d
5   6         f     f

In [103]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   raw_grade  6 non-null      object
 2   grade      6 non-null      category
dtypes: category(1), int64(1), object(1)
memory usage: 454.0+ bytes

In [104]:
df['grade']

0     a
1     b
2     c
3    d+
4     d
5     f
Name: grade, dtype: category
Categories (6, object): ['a', 'b', 'c', 'd', 'd+', 'f']

In [105]:
df.sort_values(by='grade')

# ㅋㅊ
# df['grade']

   id raw_grade grade
0   1         a     a
1   2         b     b
2   3         c     c
4   5         d     d
3   4        d+    d+
5   6         f     f

In [106]:
df.groupby('grade').size()

/var/folders/44/0l87xs4136n5n95018b2kvrc0000gn/T/ipykernel_2379/1228277667.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby('grade').size()

grade
a     1
b     1
c     1
d     1
d+    1
f     1
dtype: int64

In [108]:
# a, b, c, d를 다른 그룹핑 이름으로 변경 가능
df['grade'].cat.rename_categories(['Excelent', 'Good', 'SoSo', 'Effort', 'Bad', 'Die'])

0    Excelent
1        Good
2        SoSo
3         Bad
4      Effort
5         Die
Name: grade, dtype: category
Categories (6, object): ['Excelent', 'Good', 'SoSo', 'Effort', 'Bad', 'Die']

##### 전처리 중 결측치/이상치 제거
캐글 또는 Seaborn의 타이타닉 생존자 데이터로 결측치/이상치 검색 및 처리

In [110]:
import seaborn as sns

In [112]:
# seaborn 라이브러리에서 제공하는 데이터셋의 이름을 반환하는 함수
sns.get_dataset_names()[-1]

'titanic'

In [113]:
dfTitanic = sns.load_dataset('titanic')
dfTitanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

##### 컬럼 설명
|컬럼명|설명|
|----|---|
|Survived|생존여부(1: 생존)|
|Pclass||객실등급(1~3)|
|Sex|성별(male/female)|
|Age|나이|
|Sibsp|형제or배우자|
|Parch|부모or자녀자수|
|Fare|객실요금|
|Embarked|탑승항구 이니셜(S, C, Q)|
|Who|남자or여자or아이|
|Adult_male|성인남자여부|
|DeckNum|데크번호|
|Embark_Town|탑승항구(Southampton, Cherbourg, Queenstown)|
|Alive|생존여부(Y/N)|
|Alone|혼자탑승여부|

In [114]:
dfTitanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [118]:
# 복사본 만들기
dfCopy = dfTitanic.copy()

# 필요 열(coulmns)만 가져올때
dfCopy[['survived', 'age', 'fare']].tail()

     survived   age   fare
886         0  27.0  13.00
887         1  19.0  30.00
888         0   NaN  23.45
889         1  26.0  30.00
890         0  32.0   7.75

In [125]:
# 필요 행(row)만 가져올때 >> 연속된 행
# 파이썬 리스트 slice와 유사
dfCopy.loc[0 : 5] # 1~5 행

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True

In [126]:
# 필요 행(row)만 가져올때 >> 필요 행
dfCopy.loc[[0, 5]] # 1,5 행

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True